tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_XBAR_NUM_OUT221.h
#define XBAR_NUM_OUT221_SEL_SEL52_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL52_SHIFT          (0U)
/*! SEL52 - SEL52 */
#define XBAR_NUM_OUT221_SEL_SEL52(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL52_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL52_MASK)

#define XBAR_NUM_OUT221_SEL_SEL54_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL54_SHIFT          (0U)
/*! SEL54 - SEL54 */
#define XBAR_NUM_OUT221_SEL_SEL54(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL54_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL54_MASK)

#define XBAR_NUM_OUT221_SEL_SEL56_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL56_SHIFT          (0U)
/*! SEL56 - SEL56 */
#define XBAR_NUM_OUT221_SEL_SEL56(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL56_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL56_MASK)

#define XBAR_NUM_OUT221_SEL_SEL58_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL58_SHIFT          (0U)
/*! SEL58 - SEL58 */
#define XBAR_NUM_OUT221_SEL_SEL58(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL58_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL58_MASK)

#define XBAR_NUM_OUT221_SEL_SEL60_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL60_SHIFT          (0U)
/*! SEL60 - SEL60 */
#define XBAR_NUM_OUT221_SEL_SEL60(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL60_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL60_MASK)

#define XBAR_NUM_OUT221_SEL_SEL62_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL62_SHIFT          (0U)
/*! SEL62 - SEL62 */
#define XBAR_NUM_OUT221_SEL_SEL62(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL62_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL62_MASK)

#define XBAR_NUM_OUT221_SEL_SEL64_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL64_SHIFT          (0U)
/*! SEL64 - SEL64 */
#define XBAR_NUM_OUT221_SEL_SEL64(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL64_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL64_MASK)

#define XBAR_NUM_OUT221_SEL_SEL66_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL66_SHIFT          (0U)
/*! SEL66 - SEL66 */
#define XBAR_NUM_OUT221_SEL_SEL66(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL66_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL66_MASK)

#define XBAR_NUM_OUT221_SEL_SEL68_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL68_SHIFT          (0U)
/*! SEL68 - SEL68 */
#define XBAR_NUM_OUT221_SEL_SEL68(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL68_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL68_MASK)

#define XBAR_NUM_OUT221_SEL_SEL70_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL70_SHIFT          (0U)
/*! SEL70 - SEL70 */
#define XBAR_NUM_OUT221_SEL_SEL70(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL70_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL70_MASK)

#define XBAR_NUM_OUT221_SEL_SEL72_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL72_SHIFT          (0U)
/*! SEL72 - SEL72 */
#define XBAR_NUM_OUT221_SEL_SEL72(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL72_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL72_MASK)

#define XBAR_NUM_OUT221_SEL_SEL74_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL74_SHIFT          (0U)
/*! SEL74 - SEL74 */
#define XBAR_NUM_OUT221_SEL_SEL74(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL74_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL74_MASK)

#define XBAR_NUM_OUT221_SEL_SEL76_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL76_SHIFT          (0U)
/*! SEL76 - SEL76 */
#define XBAR_NUM_OUT221_SEL_SEL76(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL76_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL76_MASK)

#define XBAR_NUM_OUT221_SEL_SEL78_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL78_SHIFT          (0U)
/*! SEL78 - SEL78 */
#define XBAR_NUM_OUT221_SEL_SEL78(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL78_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL78_MASK)

#define XBAR_NUM_OUT221_SEL_SEL80_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL80_SHIFT          (0U)
/*! SEL80 - SEL80 */
#define XBAR_NUM_OUT221_SEL_SEL80(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL80_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL80_MASK)

#define XBAR_NUM_OUT221_SEL_SEL82_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL82_SHIFT          (0U)
/*! SEL82 - SEL82 */
#define XBAR_NUM_OUT221_SEL_SEL82(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL82_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL82_MASK)

#define XBAR_NUM_OUT221_SEL_SEL84_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL84_SHIFT          (0U)
/*! SEL84 - SEL84 */
#define XBAR_NUM_OUT221_SEL_SEL84(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL84_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL84_MASK)

#define XBAR_NUM_OUT221_SEL_SEL86_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL86_SHIFT          (0U)
/*! SEL86 - SEL86 */
#define XBAR_NUM_OUT221_SEL_SEL86(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL86_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL86_MASK)

#define XBAR_NUM_OUT221_SEL_SEL88_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL88_SHIFT          (0U)
/*! SEL88 - SEL88 */
#define XBAR_NUM_OUT221_SEL_SEL88(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL88_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL88_MASK)

#define XBAR_NUM_OUT221_SEL_SEL90_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL90_SHIFT          (0U)
/*! SEL90 - SEL90 */
#define XBAR_NUM_OUT221_SEL_SEL90(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL90_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL90_MASK)

#define XBAR_NUM_OUT221_SEL_SEL92_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL92_SHIFT          (0U)
/*! SEL92 - SEL92 */
#define XBAR_NUM_OUT221_SEL_SEL92(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL92_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL92_MASK)

